{"!": 0,
"\"": 1,
"%": 2,
"&": 3,
"'": 4,
"(": 5,
")": 6,
"*": 7,
"+": 8,
",": 9,
"-": 10,
"--": 11,
"---": 12,
".": 13,
"/": 14,
"0": 15,
"0.1": 16,
"0.14": 17,
"0.4": 18,
"0.5": 19,
"1": 20,
"2": 21,
"3": 22,
"3.1": 23,
"3.2": 24,
"4": 25,
"5": 26,
"6": 27,
"7": 28,
"8": 29,
"8.5": 30,
"9": 31,
":": 32,
";": 33,
"<": 34,
"<EOS>": 35,
"<PAD>": 36,
"<SOS>": 37,
"<UNK>": 38,
"=": 39,
">": 40,
"?": 41,
"A": 42,
"B": 43,
"C": 44,
"D": 45,
"E": 46,
"F": 47,
"G": 48,
"H": 49,
"I": 50,
"J": 51,
"K": 52,
"L": 53,
"M": 54,
"N": 55,
"O": 56,
"Object]": 57,
"P": 58,
"Q": 59,
"R": 60,
"S": 61,
"T": 62,
"U": 63,
"V": 64,
"W": 65,
"X": 66,
"Y": 67,
"Z": 68,
"[": 69,
"[object": 70,
"\\": 71,
"\\!": 72,
"\\#": 73,
"\\&": 74,
"\\'": 75,
"\\*": 76,
"\\,": 77,
"\\-": 78,
"\\/": 79,
"\\:": 80,
"\\;": 81,
"\\AA": 82,
"\\Big": 83,
"\\Bigg": 84,
"\\Biggl": 85,
"\\Biggm": 86,
"\\Biggr": 87,
"\\Bigl": 88,
"\\Bigm": 89,
"\\Bigr": 90,
"\\Delta": 91,
"\\Downarrow": 92,
"\\Gamma": 93,
"\\Huge": 94,
"\\Im": 95,
"\\L": 96,
"\\LARGE": 97,
"\\Lambda": 98,
"\\Large": 99,
"\\Leftrightarrow": 100,
"\\Longleftarrow": 101,
"\\Longleftrightarrow": 102,
"\\Longrightarrow": 103,
"\\O": 104,
"\\Omega": 105,
"\\P": 106,
"\\Phi": 107,
"\\Pi": 108,
"\\Psi": 109,
"\\Re": 110,
"\\Rightarrow": 111,
"\\S": 112,
"\\SS": 113,
"\\Sigma": 114,
"\\Theta": 115,
"\\Upsilon": 116,
"\\Vert": 117,
"\\Xi": 118,
"\\\\": 119,
"\\_": 120,
"\\acute": 121,
"\\ae": 122,
"\\aleph": 123,
"\\alpha": 124,
"\\amalg": 125,
"\\angle": 126,
"\\approx": 127,
"\\arccos": 128,
"\\arcsin": 129,
"\\arctan": 130,
"\\arg": 131,
"\\arraycolsep": 132,
"\\arraystretch": 133,
"\\arrowvert": 134,
"\\ast": 135,
"\\asymp": 136,
"\\atop": 137,
"\\b": 138,
"\\backsim": 139,
"\\backslash": 140,
"\\bar": 141,
"\\because": 142,
"\\begin{array}": 143,
"\\begin{cases}": 144,
"\\begin{matrix}": 145,
"\\begin{picture}": 146,
"\\beta": 147,
"\\bf": 148,
"\\big": 149,
"\\bigcap": 150,
"\\bigcirc": 151,
"\\bigcup": 152,
"\\bigg": 153,
"\\biggl": 154,
"\\biggr": 155,
"\\bigl": 156,
"\\bigm": 157,
"\\bigoplus": 158,
"\\bigotimes": 159,
"\\bigr": 160,
"\\bigsqcup": 161,
"\\bigtriangledown": 162,
"\\bigtriangleup": 163,
"\\bigwedge": 164,
"\\binom": 165,
"\\bmod": 166,
"\\boldmath": 167,
"\\boldsymbol": 168,
"\\bot": 169,
"\\breve": 170,
"\\buildrel": 171,
"\\bullet": 172,
"\\c": 173,
"\\cal": 174,
"\\cap": 175,
"\\cdot": 176,
"\\cdotp": 177,
"\\cdots": 178,
"\\check": 179,
"\\chi": 180,
"\\circ": 181,
"\\circle": 182,
"\\cite": 183,
"\\colon": 184,
"\\complement": 185,
"\\cong": 186,
"\\cos": 187,
"\\cosh": 188,
"\\cot": 189,
"\\coth": 190,
"\\crcr": 191,
"\\cup": 192,
"\\d": 193,
"\\dag": 194,
"\\dagger": 195,
"\\ddag": 196,
"\\ddagger": 197,
"\\ddot": 198,
"\\ddots": 199,
"\\deg": 200,
"\\delta": 201,
"\\det": 202,
"\\diamond": 203,
"\\diamondsuit": 204,
"\\dim": 205,
"\\displaystyle": 206,
"\\div": 207,
"\\do": 208,
"\\dot": 209,
"\\doteq": 210,
"\\dots": 211,
"\\downarrow": 212,
"\\ell": 213,
"\\em": 214,
"\\emptyset": 215,
"\\end{array}": 216,
"\\end{cases}": 217,
"\\end{matrix}": 218,
"\\end{picture}": 219,
"\\enskip": 220,
"\\enspace": 221,
"\\ensuremath": 222,
"\\epsilon": 223,
"\\equiv": 224,
"\\eta": 225,
"\\exists": 226,
"\\exp": 227,
"\\fbox": 228,
"\\fboxsep": 229,
"\\flat": 230,
"\\footnotesize": 231,
"\\forall": 232,
"\\frac": 233,
"\\framebox": 234,
"\\gamma": 235,
"\\ge": 236,
"\\geq": 237,
"\\geqslant": 238,
"\\gg": 239,
"\\grave": 240,
"\\hat": 241,
"\\hbar": 242,
"\\hfil": 243,
"\\hfill": 244,
"\\hline": 245,
"\\hookrightarrow": 246,
"\\hphantom": 247,
"\\hrule": 248,
"\\hspace": 249,
"\\hss": 250,
"\\i": 251,
"\\imath": 252,
"\\in": 253,
"\\infty": 254,
"\\int": 255,
"\\iota": 256,
"\\it": 257,
"\\itshape": 258,
"\\j": 259,
"\\jmath": 260,
"\\kappa": 261,
"\\kern": 262,
"\\l": 263,
"\\label": 264,
"\\lambda": 265,
"\\land": 266,
"\\langle": 267,
"\\large": 268,
"\\lbrace": 269,
"\\lbrack": 270,
"\\lceil": 271,
"\\ldots": 272,
"\\le": 273,
"\\left(": 274,
"\\left.": 275,
"\\left<": 276,
"\\left[": 277,
"\\left\\langle": 278,
"\\left\\lbrace": 279,
"\\left\\lbrack": 280,
"\\left\\lfloor": 281,
"\\left\\vert": 282,
"\\left\\{": 283,
"\\left\\|": 284,
"\\leftarrow": 285,
"\\lefteqn": 286,
"\\leftrightarrow": 287,
"\\left|": 288,
"\\leq": 289,
"\\leqslant": 290,
"\\lfloor": 291,
"\\lg": 292,
"\\lgroup": 293,
"\\lim": 294,
"\\line": 295,
"\\ll": 296,
"\\llap": 297,
"\\ln": 298,
"\\log": 299,
"\\longleftarrow": 300,
"\\longleftrightarrow": 301,
"\\longmapsto": 302,
"\\longrightarrow": 303,
"\\lower": 304,
"\\lq": 305,
"\\m": 306,
"\\makebox": 307,
"\\mapsto": 308,
"\\mathbf": 309,
"\\mathbin": 310,
"\\mathcal": 311,
"\\mathit": 312,
"\\mathop": 313,
"\\mathrel": 314,
"\\mathrm": 315,
"\\mathsf": 316,
"\\mathversion": 317,
"\\max": 318,
"\\medskip": 319,
"\\mid": 320,
"\\min": 321,
"\\mit": 322,
"\\mkern": 323,
"\\mp": 324,
"\\mskip": 325,
"\\mu": 326,
"\\multicolumn": 327,
"\\multiput": 328,
"\\nabla": 329,
"\\natural": 330,
"\\ne": 331,
"\\neq": 332,
"\\ni": 333,
"\\noalign": 334,
"\\nolinebreak": 335,
"\\nonumber": 336,
"\\normalsize": 337,
"\\not": 338,
"\\notin": 339,
"\\nsubseteq": 340,
"\\nsupseteq": 341,
"\\nu": 342,
"\\null": 343,
"\\o": 344,
"\\odot": 345,
"\\oint": 346,
"\\omega": 347,
"\\ominus": 348,
"\\ooalign": 349,
"\\operatorname": 350,
"\\operatorname*": 351,
"\\oplus": 352,
"\\oslash": 353,
"\\otimes": 354,
"\\overbrace": 355,
"\\overleftarrow": 356,
"\\overline": 357,
"\\overrightarrow": 358,
"\\parallel": 359,
"\\parbox": 360,
"\\partial": 361,
"\\perp": 362,
"\\phantom": 363,
"\\phi": 364,
"\\pi": 365,
"\\pm": 366,
"\\pmod": 367,
"\\pounds": 368,
"\\prec": 369,
"\\prime": 370,
"\\prod": 371,
"\\propto": 372,
"\\protect": 373,
"\\protectu": 374,
"\\psi": 375,
"\\put": 376,
"\\qquad": 377,
"\\quad": 378,
"\\raise": 379,
"\\raisebox": 380,
"\\rangle": 381,
"\\rbrace": 382,
"\\rbrack": 383,
"\\ref": 384,
"\\relax": 385,
"\\renewcommand": 386,
"\\rfloor": 387,
"\\rgroup": 388,
"\\rho": 389,
"\\right)": 390,
"\\right.": 391,
"\\right>": 392,
"\\right\rangle": 393,
"\\right\rbrace": 394,
"\\right\rbrack": 395,
"\\right\rfloor": 396,
"\\right\\vert": 397,
"\\right\\|": 398,
"\\right\\}": 399,
"\\right]": 400,
"\\rightarrow": 401,
"\\rightharpoonup": 402,
"\\rightleftharpoons": 403,
"\\right|": 404,
"\\rlap": 405,
"\\sb": 406,
"\\sc": 407,
"\\scriptscriptstyle": 408,
"\\scriptsize": 409,
"\\scriptstyle": 410,
"\\sec": 411,
"\\setcounter": 412,
"\\setlength": 413,
"\\setminus": 414,
"\\sf": 415,
"\\sharp": 416,
"\\sigma": 417,
"\\sim": 418,
"\\simeq": 419,
"\\sin": 420,
"\\sinh": 421,
"\\skew": 422,
"\\sl": 423,
"\\slash": 424,
"\\small": 425,
"\\smallint": 426,
"\\smallskip": 427,
"\\smash": 428,
"\\smile": 429,
"\\sp": 430,
"\\space": 431,
"\\special": 432,
"\\sqcap": 433,
"\\sqcup": 434,
"\\sqrt": 435,
"\\square": 436,
"\\ss": 437,
"\\stackrel": 438,
"\\star": 439,
"\\strut": 440,
"\\subset": 441,
"\\subseteq": 442,
"\\succeq": 443,
"\\sum": 444,
"\\sup": 445,
"\\supset": 446,
"\\supseteq": 447,
"\\supsetneq": 448,
"\\surd": 449,
"\\tan": 450,
"\\tanh": 451,
"\\tau": 452,
"\\text": 453,
"\\textbf": 454,
"\\textit": 455,
"\\textnormal": 456,
"\\textrm": 457,
"\\textsf": 458,
"\\textstyle": 459,
"\\texttt": 460,
"\\textup": 461,
"\\therefore": 462,
"\\theta": 463,
"\\thicklines": 464,
"\\thinspace": 465,
"\\tilde": 466,
"\\times": 467,
"\\tiny": 468,
"\\to": 469,
"\\top": 470,
"\\triangle": 471,
"\\triangleq": 472,
"\\triangleright": 473,
"\\tt": 474,
"\\unboldmath": 475,
"\\underbrace": 476,
"\\underline": 477,
"\\unitlength": 478,
"\\uparrow": 479,
"\\upsilon": 480,
"\\varepsilon": 481,
"\\varnothing": 482,
"\\varphi": 483,
"\\varpi": 484,
"\\varrho": 485,
"\\varsigma": 486,
"\\varsubsetneqq": 487,
"\\vartheta": 488,
"\\vcenter": 489,
"\\vdash": 490,
"\\vdots": 491,
"\\vec": 492,
"\\vee": 493,
"\\vert": 494,
"\\vline": 495,
"\\vphantom": 496,
"\\vrule": 497,
"\\vskip": 498,
"\\vspace": 499,
"\\vss": 500,
"\\wedge": 501,
"\\widehat": 502,
"\\widetilde": 503,
"\\wp": 504,
"\\xi": 505,
"\\zeta": 506,
"\\{": 507,
"\\|": 508,
"\\}": 509,
"]": 510,
"^": 511,
"_": 512,
"`": 513,
"a": 514,
"b": 515,
"c": 516,
"cm": 517,
"d": 518,
"e": 519,
"f": 520,
"g": 521,
"h": 522,
"i": 523,
"in": 524,
"j": 525,
"k": 526,
"l": 527,
"m": 528,
"mm": 529,
"n": 530,
"o": 531,
"p": 532,
"pt": 533,
"q": 534,
"r": 535,
"s": 536,
"t": 537,
"u": 538,
"ule": 539,
"v": 540,
"w": 541,
"x": 542,
"y": 543,
"z": 544,
"{": 545,
"|": 546,
"}": 547,
"~": 548
}
